#+title: Paraview notes
#+date: <2021-06-02 Wed>
#+author: Nasser Alkmim
#+draft: t
#+toc: t
#+tags[]: tools paraview  
Notes about paraview.
** =pvpython.exe=
Calls the right python interpreter connected to the paraview server.

Usually a good idea to create an alias for this python interpreter or add it to the path variable.

#+begin_src shell
cd "/mnt/c/Program Files/ParaView 5.9.1-Windows-Python3.8-msvc2017-64bit/bin/"
ls -la | grep py
#+end_src

#+RESULTS:
: -r-xr-xr-x 1 nasser nasser    22528 May 17 21:03 pvpython.exe
: -r-xr-xr-x 1 nasser nasser  4205584 May 17 21:03 python38.dll

#+begin_src shell
pvpython -c "import sys; print(sys.version); print(sys.path[1:5])"
#+end_src

#+RESULTS:
: 3.8.6 (tags/v3.8.6:db45529, Sep 23 2020, 15:52:53) [MSC v.1927 64 bit (AMD64)]
: ['C:\\Program Files\\ParaView 5.9.1-Windows-Python3.8-msvc2017-64bit\\bin\\Lib\\site-packages', 'C:\\Program Files\\ParaView 5.9.1-Windows-Python3.8-msvc2017-64bit\\bin\\python38.zip', 'C:\\Program Files\\ParaView 5.9.1-Windows-Python3.8-msvc2017-64bit\\bin\\DLLs', 'C:\\Program Files\\ParaView 5.9.1-Windows-Python3.8-msvc2017-64bit\\bin\\lib']

